In [4]:
%load_ext autoreload
%autoreload 2

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [5]:
import pandas as pd
import numpy as np

#### Load the training and testing df.

In [9]:
total_sales_train = pd.read_parquet('../../data/interim/predictive_sales_train.to_parquet')

In [ ]:
total_sale_test = pd.read_parquet('../../data/interim/predictive_sales_test.to_parquet')

#### Extract the `total_revenue` by multiplying the `sell_price` and `sales` features.

In [5]:
total_sales_train['total_revenue'] = total_sales_train['sell_price'] * total_sales_train['sales']

In [8]:
total_sale_test['total_revenue'] = total_sale_test['sell_price'] * total_sale_test['sales']

#### Group by `date` and `sum` all of the `total_revenue`

In [9]:
total_sales_train = total_sales_train.groupby(['date'])['total_revenue'].sum().reset_index()
total_sales_test = total_sale_test.groupby(['date'])['total_revenue'].sum().reset_index()

#### Save both df into a parquet file

In [10]:
total_sales_train

           date  total_revenue
0    2011-01-29       81650.61
1    2011-01-30       78970.57
2    2011-01-31       57706.91
3    2011-02-01       60761.20
4    2011-02-02       46959.95
...         ...            ...
1536 2015-04-14      102896.92
1537 2015-04-15      106913.88
1538 2015-04-16       98373.49
1539 2015-04-17      103030.58
1540 2015-04-18      132625.89

[1541 rows x 2 columns]

In [11]:
total_sales_test

          date  total_revenue
0   2015-04-19      141758.65
1   2015-04-20      105781.23
2   2015-04-21       96606.05
3   2015-04-22       95237.65
4   2015-04-23       96460.08
..         ...            ...
395 2016-05-18      116333.11
396 2016-05-19      117456.32
397 2016-05-20      134000.67
398 2016-05-21      162395.65
399 2016-05-22      175297.42

[400 rows x 2 columns]

In [14]:
total_sales_train.to_parquet('../../data/processed/forecasting_df_train.to_parquet')
total_sales_test.to_parquet('../../data/processed/forecasting_df_test.to_parquet')